In [1]:
"""
Data cleaning means fixing bad data in your data set.

Bad data could be:
    - Empty cells - give you a wrong result when you analyze data.
        - remove row contain empty cells (dataset usually very large, so removing some rows will not a big deal)
        - Replace Empty Values - not have to delete entire rows just because of some empty cells
        - Replace Using Mean, Median, or Mode (the value that appears most frequently.)
    - Data in wrong format
        - remove the rows
        - convert to the same format
    - Wrong data
        - Replacing Values
    - Duplicates
"""

'\nData cleaning means fixing bad data in your data set.\n\nBad data could be:\n    - Empty cells - give you a wrong result when you analyze data.\n        - remove row contain empty cells (dataset usually very large, so removing some rows will not a big deal)\n        - Replace Empty Values - not have to delete entire rows just because of some empty cells\n        - Replace Using Mean, Median, or Mode (the value that appears most frequently.)\n    - Data in wrong format\n        - remove the rows\n        - convert to the same format\n    - Wrong data\n        - Replacing Values\n    - Duplicates\n'

In [2]:
"""
Other type:
    - Unnecesary
"""
"""
notnull()
dropna()
fillna()
replace()
"""

'\nnotnull()\ndropna()\nfillna()\nreplace()\n'

In [3]:
import pandas as pd
import numpy as np

In [4]:
"""
- "Bad data" depend on the scenario and context of dataset
- falsy_values = (0, False, None, '', [], {})
"""
if 0:
    print("condition is True")
else: 
    print("condition is false")

condition is false

In [5]:
# - np.nan == None
np.nan + 69
# np.nan + 3
# a = np.array([1, 2, 3, np.nan, np.nan, 4])
# a
# a.sum()
# a.mean()

nan

In [6]:
# None + 3
a = np.array([1, 2, 3, np.nan, None, 4])
a = np.array([1, 2, 3, np.nan, None, 4], dtype="float")
a

array([ 1.,  2.,  3., nan, nan,  4.])

In [7]:
np.inf
3 + np.inf
np.inf / np.inf
b = np.array([1, 2, 3, np.inf, np.nan, 4], dtype="float")
b
b.sum()

nan

In [8]:
# checking for nan and inf
# np.isnan(np.nan)
# np.isinf(np.inf)
np.isnan(np.array([1, 2, 3, np.nan, np.inf, 4]))

array([False, False, False,  True, False, False])

In [9]:
# a[~np.isnan(a)]
# a[np.isfinite(a)].sum()

np.isnan(a)
sr_2 = a[~np.isnan(a)]

In [10]:
pd.isnull(np.nan)
pd.isna(np.nan)

# opposite
pd.notnull(None)
pd.notna(np.nan)
pd.notna(0)

True

In [11]:
# work with series or dataframe
pd.isnull(pd.Series([1, np.nan, 7]))
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [12]:
dict = {
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
}

df = pd.DataFrame(dict)
df[pd.notnull(df)]

   Column A  Column B  Column C
0       1.0       NaN       NaN
1       NaN       2.0       2.0
2       7.0       3.0       NaN

In [13]:
df

   Column A  Column B  Column C
0       1.0       NaN       NaN
1       NaN       2.0       2.0
2       7.0       3.0       NaN

In [14]:
pd.Series([1, 2, np.nan]).count()
# pd.Series([1, 2, np.nan]).sum()
# pd.Series([2, 2, np.nan]).mean()

2

In [15]:
# filtering missing data
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [16]:
# pd.notnull(s)
# pd.isnull(s)
# # sum does not return sum of value, it's return the number of value
# pd.notnull(s).sum()
# pd.isnull(s).sum()
pd.notnull(s).sum()

4

In [17]:
s.isnull() # ==> series and dataframe have isnull()
s[pd.notnull(s)]
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [18]:
# drop nan item

# s.dropna()

s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [19]:
# with DataFrame, there will be a few more things to consider, because you can't drop single values. You can only drop entire columns or rows
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 34, 110],
    # 'Column E': [np.nan, np.nan, np.nan, np.nan],
})
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [20]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [21]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [22]:
# df.isnull().sum()
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [23]:
# The default dropna behavior will drop all the rows in which any null value is present:
# df.dropna()
# df.dropna(axis=1)
# df.dropna(axis='columns')
# df.dropna(axis="columns")
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [24]:
# df.dropna(how='any')  # default behavior
# df.dropna(how='all')

# any - all
df.dropna(how="all", axis="columns")
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [25]:
# thresh parameter to indicate a threshold (a minimum number) of non-null values for the row/column to be kept
# df.dropna(thresh=3) 
df.dropna(thresh=4)

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [26]:
# fill nan
# s.fillna(0)
# s.fillna(s.mean())
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])
x = s.mean()
c = s.median()
s = s.fillna(c)

s.describe()

count    6.000
mean     2.500
std      1.000
min      1.000
25%      2.125
50%      2.500
75%      2.875
max      4.000
dtype: float64

In [27]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])
# s.fillna(method='ffill')
# s.fillna(method='bfill')
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [28]:
# not recommend, cuz it's can make a mess
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

In [29]:
# fill dataframe
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})
# df.fillna(method='ffill', axis=0)
# df.fillna(method='ffill', axis='rows')

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [30]:
# Checking if there are NAs
# The question is: Does this `Series` or `DataFrame` contain any missing value? The answer should be yes or no: `True` or `False`. How can you verify it?

In [31]:
# **Example 1: Checking the length**

# If there are missing values, `s.dropna()` will have less elements than `s`:

# s.dropna().count()
# missing_values = len(s.dropna()) != len(s)
# missing_values = s.count() != len(s)
# missing_values


if s.count() < len(s):
    print("có np.nan")
else:
    print("ko có np.nan")

có np.nan

In [32]:
len(s)
s.count()

4

In [33]:
# The methods `any` and `all` check if either there's `any` True value in a Series or `all` the values are `True`. They work in the same way as in Python:

In [34]:
# pd.Series([1, np.nan]).isnull().any()
# pd.Series([1, 2]).isnull().any()
# s.isnull().any()
s.isnull().any()

True

#### end of empty cell

In [35]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25],
})
df.head(3)

  Sex  Age
0   M   29
1   F   30
2   F   24

In [36]:
# finding unique values: notice them, identify them and handle them (remove, replace, etc)

In [37]:
# df['Sex'].unique()
# np.size(df['Sex'].unique())
# df['Sex'].value_counts()

df["Sex"].unique()
# np.size(df["Sex"].unique())

array(['M', 'F', 'D', '?'], dtype=object)

In [38]:
df = pd.read_csv("resource/simple_student.csv")
df

            ID                Full Name Sex  Mark            Note
0  Nestech_001         Nguyen Phu Trong   M    10      Lop Truong
1  Nestech_002            Vo Van Thuong   M     9  Pho Lop Truong
2  Nestech_003  Nguyen Hoang Kieu Trinh   F     4             NaN
3  Nestech_004            Viktor Nguyen   M     7             NaN
4  Nestech_005             Clint Nguyen   M     7             NaN
5  Nestech_006          Nguyen Van Toan   M     9             NaN
6  Nestech_007          Kha Kim Bao Han   F    10              Ex
7  Nestech_008         Pham Le Tram Anh   F     5              Ex
8  Nestech_009       Ba Hoang Kim Thinh   F     3              Ex
9  Nestech_010           Giap Phi Hoang   M     6      Y Thuc Kem

In [39]:
# df_2 = df["Sex"].replace("M", "F") # inplace=True
# df_2 = df["Sex"].replace({"M":"F"})
# df_2
# df['Sex'].replace('D', 'F')
# df['Sex'].replace({'D': 'F', 'N': 'M'})
df.replace({
    'Sex': {
        'D': 'F',
        '?': 'M'
    },
    'Age': {
        290: 29
    }
})

            ID                Full Name Sex  Mark            Note
0  Nestech_001         Nguyen Phu Trong   M    10      Lop Truong
1  Nestech_002            Vo Van Thuong   M     9  Pho Lop Truong
2  Nestech_003  Nguyen Hoang Kieu Trinh   F     4             NaN
3  Nestech_004            Viktor Nguyen   M     7             NaN
4  Nestech_005             Clint Nguyen   M     7             NaN
5  Nestech_006          Nguyen Van Toan   M     9             NaN
6  Nestech_007          Kha Kim Bao Han   F    10              Ex
7  Nestech_008         Pham Le Tram Anh   F     5              Ex
8  Nestech_009       Ba Hoang Kim Thinh   F     3              Ex
9  Nestech_010           Giap Phi Hoang   M     6      Y Thuc Kem

In [40]:
# df[df['Age'] > 100]
# # df.loc[df["Age"] > 100, "Age"]
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

# df[df["Age"] > 100] = 
df

KeyError: 'Age'

In [ ]:
# handling duplicated data
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])
ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [ ]:
# ambassadors
ambassadors.duplicated()

Gérard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [ ]:
ambassadors.drop_duplicates()

Gérard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [ ]:
ambassadors.duplicated()
ambassadors.duplicated(keep='last')
# ambassadors.duplicated(keep=False)

Gérard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [ ]:
ambassadors.drop_duplicates()
ambassadors.drop_duplicates(keep='last')
ambassadors.drop_duplicates(keep=False)

In [ ]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})
players

In [ ]:
players.duplicated()
players.duplicated(subset=['Name'])
players.duplicated(subset=['Name'], keep='last')

In [ ]:
players.drop_duplicates()
players.drop_duplicates(subset=['Name'])
players.drop_duplicates(subset=['Name'], keep='last')

In [ ]:
# text handling
df = pd.DataFrame({
    'Data': [
        '1987_M_US _1',
        '1990?_M_UK_1',
        '1992_F_US_2',
        '1970?_M_   VN_1',
        '1985_F_V   N_2'
]})
df
# "year, Sex, Country and number of children"

In [ ]:
df['Data'].str.split('_')
df['Data'].str.split('_', expand=True)
df = df['Data'].str.split('_', expand=True)
df

In [ ]:
df.columns = ['Year', 'Sex', 'Country', 'No Children']
df

In [ ]:
df['Year'].str.contains('\?')
df['Country'].str.contains('U')

In [ ]:
df['Country'].str.strip()
df['Country'].str.lstrip()
df['Country'].str.rstrip()
df['Country'].str.replace(' ', '')

In [ ]:
df = pd.read_csv("resource\simple_student_detail_wrong.csv")
df

In [ ]:
# df.shape
# df.info()
# df.describe()
# df[["math", "physics", "biology", "chemistry", "english", "art", "music"]].astype("int64")
df[["math", "physics", "biology", "chemistry", "english", "art", "music"]]

In [ ]:
# remove_na_df = df.dropna() # remove row
# remove_na_df = df.fillna(5) # replace empty value
remove_na_df = df[["math", "physics"]].fillna(5) # replace empty value
remove_na_df

In [ ]:
# df["math"] = df["math"].astype(str)
# df["math"] = pd.to_datetime()
# df.dropna(subset=["math"])
df

In [ ]:
df.loc[6, 'physics'] = 7.9
df

In [ ]:
for x in df.index:
    if df.loc[x, "math"] > 10:
        df.loc[x, "math"] = 18

In [ ]:
for x in df.index:
    if df.loc[x, "math"] > 10:
        df.drop(x, inplace = True)

In [ ]:
df.duplicated()
df.drop_duplicates()